OpenFOAM_6/test/multiphase/reactingTwoPhaseEulerFoam/populationBalanceModeling/drift/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0  0  0 )
    (10 0  0 )
    (10 10 0 )
    (0  10 0 )
    (0  0  10)
    (10 0  10)
    (10 10 10)
    (0  10 10)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 1 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
);

mergePatchPairs
(
);

// ************************************************************************* //
